import numpy as np

# 儲存相機參數

# 雙目相機參數
class stereoCamera(object):
    def __init__(self):
        # 左相機內參
        self.cam_matrix_left = np.array([[718.91784516,   0,         523.81794096],
 [  0,         729.9676401,  285.67599007],
 [  0,           0,           1        ]])

                                         
        # 右相機內參
        self.cam_matrix_right = np.array([[722.0596431,    0,         513.69586443],
 [  0,         732.73467429, 292.73935455],
 [  0,           0,           1,        ]])

        # 左右相機畸變係數:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[ 3.10654667e-02, -1.79710419e-01,  8.74245497e-04,  1.77051639e-04,
   2.13729056e-01]])

        self.distortion_r = np.array([[ 0.01106482, -0.13689889, -0.00141579,  0.001299,    0.20230678]])

        # 旋轉矩陣
        self.R = np.array([[ 0.99936535,  0.00766217, -0.03478784],
 [-0.00858504, 0.99961309, -0.02645698],
 [ 0.03457166,  0.02673885,  0.99904446]])

        # 平移矩陣
        self.T = np.array([[ 6.32313216],
 [-0.1437672 ],
 [ 0.13653885]])

        # 焦距
        self.focal_length = 1764.82558    # 默認值，一般取立體校正後的重投影矩陣Q中的 Q[2,3]

        # 基線距離
        self.baseline = 74   # 單位：mm， 爲平移向量的第一個參數（取絕對值）